{
  "education": [
    {
      "awards_achievements": [
        "CGPA: 7.21/10"
      ],
      "degree": "Bachelor of Computer Science",
      "department": "Computer Science and Engineering",
      "duration": "2015-2019",
      "school_name": "KLS Gogte Institute of Technology, India"
    },
    {
      "awards_achievements": [
        "GPA: 3.74/4"
      ],
      "degree": "Post Graduation",
      "department": "Web Design and Development",
      "duration": "2021-2022",
      "school_name": "Conestoga College - Kitchener, ON, Canada"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-samarthghadi",
  "highlighted_projects": [
    {
      "description": "Developed a Weather app utilizing an application programming interface (API) that provides weather data. The app allows users to search for the current weather by simply entering city names. It accesses weather data through an external weather API. The app fetches information such as sunset time, humidity, pressure, and wind speed. The UI is styled using HTML, CSS, and React.js, with the data fetched from the JSON file dynamically displayed using the useState hook. This app provides a user-friendly interface to access and visualize weather forecasts, enhancing the user experience with real-time weather information.",
      "git_url": "",
      "name": "Weather App"
    },
    {
      "description": "This app is developed using Core Java that allows users to play music, manage albums, create playlists, and control playback options. The application enables users to add songs to their album library and create custom playlists by adding or deleting songs. It incorporates features like playing the next or previous track and repeating songs. The project follows object-oriented principles, utilizing concepts like encapsulation, inheritance, and method overloading. The Java-based music player provides a user-friendly interface, offering a seamless music playback experience with efficient organization and management of music collections.",
      "git_url": null,
      "name": "Music Player App"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Linux monitoring tool for the Linux cluster administration (LCA) team, enabling real-time monitoring and recording of hardware and software usage across a group of Linux systems. The servers are connected through a switch. The tool collects data on hardware specifications and software utilization, including memory and CPU management. Programmed with bash scripts, automated crontab every minute for data collection, and stored into a dockerized PostgreSQL database. These reports provide valuable insights for the LCA team to decide whether to increase hardware or software specifications for the future. Git was chosen as the version control system to manage the code efficiently, ensuring versioning and collaboration among the team.",
      "git_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-samarthghadi/tree/master/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Developed a 'Customer Order Processing System' utilizing JDBC, DAO(Data Access Object), and DTO(Data Transfer Object) design patterns. The system interacts with PostgreSQL via JDBC, supporting CRUD operations and benefiting from JDBC's cross-platform compatibility. PSQL Client Tool and DBeaver were employed for database management, while Maven streamlined dependencies. The system's architecture includes a PostgreSQL container facilitated by Docker. IntelliJ served as the IDE for development. This setup ensures seamless access to relational databases. The system excels in processing customer orders, offering read, write, update, and delete functions for RDBMS data manipulation.",
        "Grep App: Developed a Grep app using tools like ArrayList, FileReader, FileWriter, BufferedReader, BufferedWriter, and Regex Pattern. To find a user-specified text pattern, it scans a chosen main folder, including files and subfolders. Using Maven and Docker, deployment is straightforward. The app extracts matching lines from files, compiling them into a text file for later use."
      ],
      "git_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-samarthghadi/tree/master/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Samarth Ghadi",
  "others": [
    {
      "bullets": [
        "Udemy Web Development Certification"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Exploring motivational literature to foster personal growth, currently enjoying 'Excuses'"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Participated in National level Roller Skating Championship"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Working as a Software Developer trainee, I am actively involved in creating Java applications using Core Java concepts, RDBMS/SQL, JDBC, and Maven. I work in an Agile Scrum environment, following appropriate software development life cycle (SDLC) practices. My role includes deploying applications and ensuring their successful implementation. I continuously learn and apply industry best practices to deliver high-quality software solutions. With a focus on teamwork and collaboration, I actively contribute to the Agile Scrum process, taking part in sprint planning, daily stand-ups, and sprint reviews.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Cubiccode Digital Media, India",
      "description": "I interned as a web developer, working on JavaScript throughout the web application development lifecycle. I was responsible for designing and creating highly optimized landing pages using HTML and CSS that aligned with the company's requirements. Additionally, I made wireframes, mockups and UI designs using tools like Photoshop and Figma. Collaborating closely with back-end developers, I ensured seamless front-end and back-end code integration while maintaining design integrity. I took sole ownership in developing e-commerce websites and web applications using WordPress using woo-commerce. Furthermore, I specialized in designing the landing pages of websites.",
      "duration": "2019-2020",
      "title": "Web Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "SQL/RDBMS",
      "Docker",
      "Web Designing/Photoshop",
      "React",
      "HTML5/CSS3"
    ],
    "familiar": [
      "Python",
      "Jest",
      "Cypress",
      "REST API",
      "Bootstrap/Material UI"
    ],
    "proficient": [
      "Java",
      "JavaScript",
      "Node/Express",
      "Angular",
      "Linux/Bash",
      "Agile/Scrum",
      "Git/Github"
    ]
  },
  "summary": "I am a Computer Science Engineering graduate from Visvesvaraya Technological University (VTU) with a post-graduate Web Design and Development certificate from Conestoga College. My expertise lies in implementing object-oriented programming methodologies in Java, including developing, debugging, and testing code. I have a solid understanding of various programming languages, such as javascript/typescript and python. I worked as a Web Developer intern, where I successfully created prototypes, mockups and wireframes using tools like Photoshop and Figma, translating designs into functional code. I possess valuable experience working in Agile and Scrum environments, enabling efficient collaboration and adaptability. I am highly self-motivated, with a solid drive to continuously learn, adapt, and master new technologies. I thrive both in team-oriented and self-directed settings."
}
